Map<int, String> hezbName = {
  // الجزء الأول
  1: 'الْحِزْبُ الأَوَّلُ',
  11: 'الْحِزْبُ الثَّانِي',
  // الجزء الثاني
  22: 'الْحِزْبُ الثَّالِثُ',
  32: 'الْحِزْبُ الرَّابِعُ',
  // الجزء الثالث
  42: 'الْحِزْبُ الْخَامِسُ',
  52: 'الْحِزْبُ السَّادِسُ',
  // الجزء الرابع
  62: 'الْحِزْبُ السَّابِعُ',
  72: 'الْحِزْبُ الثَّامِنُ',
  // الجزء الخامس
  82: 'الْحِزْبُ التَّاسِعُ',
  92: 'الْحِزْبُ الْعَاشِرُ',
  // الجزء السادس
  102: 'الْحِزْبُ الْحَادِي عَشَرَ',
  112: 'الْحِزْبُ الثَّانِي عَشَرَ',
  // الجزء السابع
  122: 'الْحِزْبُ الثَّالِثُ عَشَرَ',
  132: 'الْحِزْبُ الرَّابِعُ عَشَرَ',
  // الجزء الثامن
  142: 'الْحِزْبُ الْخَامِسُ عَشَرَ',
  152: 'الْحِزْبُ السَّادِسُ عَشَرَ',
  // الجزء التاسع
  162: 'الْحِزْبُ السَّابِعُ عَشَرَ',
  172: 'الْحِزْبُ الثَّامِنُ عَشَرَ',
  // الجزء العاشر
  182: 'الْحِزْبُ التَّاسِعُ عَشَرَ',
  192: 'الْحِزْبُ الْعِشْرُونَ',
  // الجزء الحادي عشر
  202: 'الْحِزْبُ الْحَادِي وَالْعِشْرُونَ',
  212: 'الْحِزْبُ الثَّانِي وَالْعِشْرُونَ',
  // الجزء الثاني عشر
  222: 'الْحِزْبُ الثَّالِثُ وَالْعِشْرُونَ',
  232: 'الْحِزْبُ الرَّابِعُ وَالْعِشْرُونَ',
  // الجزء الثالث عشر
  242: 'الْحِزْبُ الْخَامِسُ وَالْعِشْرُونَ',
  252: 'الْحِزْبُ السَّادِسُ وَالْعِشْرُونَ',
  // الجزء الرابع عشر
  262: 'الْحِزْبُ السَّابِعُ وَالْعِشْرُونَ',
  272: 'الْحِزْبُ الثَّامِنُ وَالْعِشْرُونَ',
  // الجزء الخامس عشر
  282: 'الْحِزْبُ التَّاسِعُ وَالْعِشْرُونَ',
  292: 'الْحِزْبُ الثَّلَاثُونَ',
  // الجزء السادس عشر
  302: 'الْحِزْبُ الْحَادِي وَالثَّلَاثُونَ',
  312: 'الْحِزْبُ الثَّانِي وَالثَّلَاثُونَ',
  // الجزء السابع عشر
  322: 'الْحِزْبُ الثَّالِثُ وَالثَّلَاثُونَ',
  332: 'الْحِزْبُ الرَّابِعُ وَالثَّلَاثُونَ',
  // الجزء الثامن عشر
  342: 'الْحِزْبُ الْخَامِسُ وَالثَّلَاثُونَ',
  352: 'الْحِزْبُ السَّادِسُ وَالثَّلَاثُونَ',
  // الجزء التاسع عشر
  362: 'الْحِزْبُ السَّابِعُ وَالثَّلَاثُونَ',
  372: 'الْحِزْبُ الثَّامِنُ وَالثَّلَاثُونَ',
  // الجزء العشرون
  382: 'الْحِزْبُ التَّاسِعُ وَالثَّلَاثُونَ',
  392: 'الْحِزْبُ الْأَرْبَعُونَ',
  // الجزء الحادي والعشرون
  402: 'الْحِزْبُ الْحَادِي وَالْأَرْبَعُونَ',
  412: 'الْحِزْبُ الثَّانِي وَالْأَرْبَعُونَ',
  // الجزء الثاني والعشرون
  422: 'الْحِزْبُ الثَّالِثُ وَالْأَرْبَعُونَ',
  432: 'الْحِزْبُ الرَّابِعُ وَالْأَرْبَعُونَ',
  // الجزء الثالث والعشرون
  442: 'الْحِزْبُ الْخَامِسُ وَالْأَرْبَعُونَ',
  452: 'الْحِزْبُ السَّادِسُ وَالْأَرْبَعُونَ',
  // الجزء الرابع والعشرون
  462: 'الْحِزْبُ السَّابِعُ وَالْأَرْبَعُونَ',
  472: 'الْحِزْبُ الثَّامِنُ وَالْأَرْبَعُونَ',
  // الجزء الخامس والعشرون
  482: 'الْحِزْبُ التَّاسِعُ وَالْأَرْبَعُونَ',
  492: 'الْحِزْبُ الْخَمْسُونَ',
  // الجزء السادس والعشرون
  502: 'الْحِزْبُ الْحَادِي وَالْخَمْسُونَ',
  512: 'الْحِزْبُ الثَّانِي وَالْخَمْسُونَ',
  // الجزء السابع والعشرون
  522: 'الْحِزْبُ الثَّالِثُ وَالْخَمْسُونَ',
  532: 'الْحِزْبُ الرَّابِعُ وَالْخَمْسُونَ',
  // الجزء الثامن والعشرون
  542: 'الْحِزْبُ الْخَامِسُ وَالْخَمْسُونَ',
  553: 'الْحِزْبُ السَّادِسُ وَالْخَمْسُونَ', // سورة الصف
  // الجزء التاسع والعشرون
  562: 'الْحِزْبُ السَّابِعُ وَالْخَمْسُونَ',
  572: 'الْحِزْبُ الثَّامِنُ وَالْخَمْسُونَ', // سورة الجن
  // الجزء الثلاثون
  582: 'الْحِزْبُ التَّاسِعُ وَالْخَمْسُونَ',
  591: 'الْحِزْبُ السِّتُّونَ', // سورة الأعلى
};
